[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/HLDdtSz7/spotify.jpg",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "description": "Spotify is a comprehensive music streaming platform that gives users access to millions of songs, podcasts, and playlists across every genre imaginable. Beyond simple playback, it offers personalized recommendations powered by advanced algorithms, helping users discover new artists and tracks tailored to their unique tastes. Users can create, share, and collaborate on playlists, follow favorite artists, and receive notifications about releases or concerts. Its high-quality audio streaming, offline listening mode, and multi-device synchronization provide seamless experiences for both casual listeners and dedicated audiophiles. With features such as podcast subscriptions, curated playlists for moods and activities, and integrated social sharing, Spotify is designed to be the ultimate companion for music lovers, fostering creativity, relaxation, and connection through sound. Whether you’re working, commuting, exercising, or simply relaxing, Spotify creates an immersive environment that adapts to your lifestyle, making every listening session engaging, informative, and highly personalized. The interface is intuitive, minimal, and distraction-free, allowing users to focus entirely on the music, while notifications and updates gently keep them informed of new content, live events, and exclusive releases. It is not just a music player; it is a dynamic ecosystem that promotes discovery, social interaction, and long-term engagement with your favorite audio content.",
    "size": 58,
    "reviews": "12.5M",
    "ratingAvg": 4.6,
    "downloads": "1.4B",
    "ratings": [
      { "name": "1 star", "count": 0.23 },
      { "name": "2 star", "count": 0.12 },
      { "name": "3 star", "count": 0.4 },
      { "name": "4 star", "count": 2.0 },
      { "name": "5 star", "count": 9.8 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/S7rcQsx1/instrag.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a visually-driven social media platform that allows users to capture, edit, and share photos, videos, and stories with their audience. The platform is designed to make content creation effortless while providing a rich ecosystem for discovery and engagement. Advanced filters, editing tools, and interactive stickers allow users to express themselves creatively. Beyond personal sharing, Instagram offers business and creator tools for audience analytics, promotions, and monetization. Users can follow friends, celebrities, and brands to stay connected with trends and updates, while the Explore feature introduces content tailored to personal interests. Notifications ensure users never miss key interactions, from likes and comments to live video alerts. Instagram Stories, Reels, and IGTV extend the creative potential, enabling short-form, engaging content that captures attention. The interface is highly intuitive and visually appealing, minimizing distractions and encouraging seamless scrolling and interaction. The platform fosters communities, conversations, and collaborations by connecting people worldwide, making it both a social connector and a creative hub. It goes beyond simple sharing, providing tools and inspiration for personal expression, professional growth, and global interaction, ensuring that users are always engaged, entertained, and connected.",
    "size": 70,
    "reviews": "18.0M",
    "ratingAvg": 4.3,
    "downloads": "5.2B",
    "ratings": [
      { "name": "1 star", "count": 0.8 },
      { "name": "2 star", "count": 0.5 },
      { "name": "3 star", "count": 1.2 },
      { "name": "4 star", "count": 4.0 },
      { "name": "5 star", "count": 11.5 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/GvZwtMQR/snap.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging app that emphasizes instant communication and playful engagement through temporary photos, videos, and chat messages. Users can capture moments using filters, augmented reality lenses, and interactive stickers, creating immersive experiences that are unique and highly shareable. Beyond messaging, Snapchat offers Stories that compile daily moments from friends and public figures, Discover content channels for trending news and entertainment, and Spotlight for user-generated viral content. The platform includes features to maintain privacy and security, with messages disappearing after viewing and options to manage visibility. Analytics and interactive elements allow users to track engagement and creatively interact with their network. Snapchat promotes social connection, self-expression, and creativity by providing tools to communicate visually and instantly, while minimizing long-term digital clutter. The interface is designed for intuitive navigation, ensuring seamless access to cameras, chats, and stories. Notifications guide users to important messages, friend interactions, or trending content. By combining personal messaging, entertainment, and social discovery in one platform, Snapchat creates an engaging environment where users can share their lives dynamically, connect meaningfully, and explore global content in a fun, interactive, and visually immersive way.",
    "size": 45,
    "reviews": "9.2M",
    "ratingAvg": 4.2,
    "downloads": "1.1B",
    "ratings": [
      { "name": "1 star", "count": 0.3 },
      { "name": "2 star", "count": 0.21 },
      { "name": "3 star", "count": 0.6 },
      { "name": "4 star", "count": 2.8 },
      { "name": "5 star", "count": 5.3 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/JwMfBJbF/tiktok.jpg",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "description": "TikTok is a dynamic short-form video platform that empowers users to create, discover, and share highly engaging content. With a focus on music, trends, and creative expression, TikTok offers an extensive set of editing tools, visual effects, and audio libraries to transform everyday moments into entertaining, viral-ready videos. The app uses powerful recommendation algorithms to curate a personalized feed, ensuring users always encounter content aligned with their interests and engagement patterns. Beyond content consumption, TikTok supports community building, live streaming, and collaborative features like duets and reactions, enhancing interaction and social connectivity. Notifications, analytics, and content insights help creators understand their audience, optimize engagement, and participate in trending challenges. The platform balances entertainment with productivity by offering learning and creative inspiration through educational videos, tutorials, and storytelling. TikTok’s interface is immersive and minimal, allowing users to focus entirely on content while fostering engagement, creativity, and social interaction. Whether for casual browsing, content creation, or professional growth, TikTok creates a vibrant ecosystem where self-expression, entertainment, and connection thrive, making every interaction meaningful and every video discovery-driven.",
    "size": 80,
    "reviews": "21.0M",
    "ratingAvg": 4.5,
    "downloads": "4.8B",
    "ratings": [
      { "name": "1 star", "count": 0.9 },
      { "name": "2 star", "count": 0.4 },
      { "name": "3 star", "count": 1.3 },
      { "name": "4 star", "count": 3.8 },
      { "name": "5 star", "count": 14.5 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/tMFTfc5m/canva.jpg",
    "title": "Canva",
    "companyName": "Canva is a versatile graphic design platform that enables users to create visually stunning content effortlessly. From social media posts, presentations, and posters to business cards, flyers, and invitations, Canva provides a wide range of templates, stock images, icons, fonts, and design elements. Its drag-and-drop interface simplifies the creative process for both beginners and professionals, making it easy to bring ideas to life without technical expertise. Users can collaborate in real-time, share designs, and receive feedback, fostering creativity and teamwork. Canva also integrates with cloud storage, social media, and printing services, allowing seamless sharing and production. Notifications guide users about template updates, design trends, and collaborative changes. The platform supports brand kits, animation, and video editing, ensuring that projects are professional and visually engaging. By combining accessibility, collaboration, and high-quality design tools, Canva empowers individuals and organizations to express themselves, market products, and communicate ideas effectively, creating a productive and inspiring creative environment.",
    "size": 60,
    "reviews": "5.2M",
    "ratingAvg": 4.8,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 0.1 },
      { "name": "2 star", "count": 0.08 },
      { "name": "3 star", "count": 0.2 },
      { "name": "4 star", "count": 1.0 },
      { "name": "5 star", "count": 3.8 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/dsBysddS/images.png",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "description": "CapCut is a professional-grade video editing application designed for both casual creators and aspiring filmmakers. It provides an extensive suite of tools including trimming, splitting, merging, speed adjustment, transitions, filters, text overlays, and effects. Users can craft cinematic videos, social media clips, or tutorials with ease, leveraging a wide array of customizable templates and royalty-free music. CapCut emphasizes creativity while minimizing technical barriers, offering intuitive gestures and AI-powered features like auto-captioning, motion tracking, and background removal. Collaborative options allow sharing projects and receiving feedback seamlessly. Notifications inform users of trending templates, effects updates, and new editing tutorials. With offline editing, high-resolution export, and cross-device compatibility, CapCut ensures every video is polished, engaging, and shareable. The platform’s design is minimal and distraction-free, enabling users to focus entirely on creative storytelling while fostering skill growth, innovation, and community engagement.",
    "size": 85,
    "reviews": "7.4M",
    "ratingAvg": 4.7,
    "downloads": "530M",
    "ratings": [
      { "name": "1 star", "count": 0.15 },
      { "name": "2 star", "count": 0.1 },
      { "name": "3 star", "count": 0.3 },
      { "name": "4 star", "count": 1.3 },
      { "name": "5 star", "count": 5.7 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/PvQzcrMn/duol.png",
    "title": "Duolingo",
    "companyName": "Duolingo is an interactive language learning platform that transforms the process of acquiring new languages into a fun, engaging, and highly effective experience. With bite-sized lessons, gamified exercises, quizzes, and speaking practice, users can learn over 30 languages at their own pace. Duolingo tracks progress, awards points for achievements, and provides detailed insights into areas for improvement. The app integrates listening, reading, writing, and speaking exercises to ensure comprehensive language mastery. Notifications and reminders encourage daily practice and consistency, enhancing retention and fluency. Users can participate in leaderboards, community challenges, and language clubs, fostering motivation and social interaction. The interface is colorful, intuitive, and distraction-free, designed to maintain focus while making learning enjoyable. Beyond just vocabulary and grammar, Duolingo cultivates cultural understanding and contextual knowledge, creating an immersive environment where users can achieve practical communication skills, confidence, and lifelong language learning habits.",
    "size": 40,
    "reviews": "6.5M",
    "ratingAvg": 4.7,
    "downloads": "540M",
    "ratings": [
      { "name": "1 star", "count": 0.1 },
      { "name": "2 star", "count": 0.07 },
      { "name": "3 star", "count": 0.25 },
      { "name": "4 star", "count": 1.3 },
      { "name": "5 star", "count": 4.8 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/5xGQbvmV/124019.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a highly secure and versatile messaging platform that offers instant communication with robust privacy and advanced functionality. Users can send text messages, multimedia content, documents, and large files seamlessly, with cloud synchronization across all devices. Telegram supports private chats, group conversations, channels for broadcasting, and bots for automation, creating a rich communication ecosystem. Security features include end-to-end encryption in Secret Chats, two-step verification, and self-destructing messages, ensuring user data is protected. Notifications keep users updated on incoming messages, mentions, and channel activities. Telegram emphasizes speed, reliability, and scalability, allowing communication with hundreds or even thousands of participants simultaneously. The interface is clean and minimal, providing easy navigation and quick access to essential tools. With integrated file storage, advanced search options, and customizable themes, Telegram is designed for both personal and professional communication, fostering connectivity, collaboration, and efficient information exchange in a secure and user-friendly environment.",
    "size": 35,
    "reviews": "8.3M",
    "ratingAvg": 4.4,
    "downloads": "1.2B",
    "ratings": [
      { "name": "1 star", "count": 0.3 },
      { "name": "2 star", "count": 0.15 },
      { "name": "3 star", "count": 0.5 },
      { "name": "4 star", "count": 2.5 },
      { "name": "5 star", "count": 5.3 }
    ]
  },

  {
    "id": 9,
    "image": "https://i.ibb.co.com/rfbQFGzQ/facebook.webp",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is a comprehensive social networking platform that enables users to connect with friends, family, colleagues, and communities worldwide. Beyond posting updates, sharing photos and videos, and interacting through likes and comments, Facebook provides features such as groups, events, marketplace, live streaming, and Stories for richer engagement. Advanced algorithms personalize user feeds to display relevant content while notifications ensure users never miss important interactions. The platform offers business tools for advertising, analytics, and content management, empowering creators and entrepreneurs to grow their presence. Privacy settings, security options, and reporting tools maintain a safe online environment. Facebook promotes social interaction, community building, and information sharing, supporting both personal expression and professional networking. Its interface is designed for easy navigation, enabling seamless engagement, content discovery, and communication, while maintaining a dynamic ecosystem where users can connect, create, and participate in a global digital community.",
    "size": 70,
    "reviews": "25M",
    "ratingAvg": 4.2,
    "downloads": "5.0B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/1YszS594/whats.webp",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp is a globally trusted messaging and calling application that offers seamless communication across smartphones and devices. Users can send text messages, voice notes, images, videos, documents, and even share locations in real-time. The platform provides voice and video calls with high-quality clarity and supports group chats for collaborative communication. End-to-end encryption ensures that conversations remain private and secure. WhatsApp Web and desktop apps provide cross-device accessibility for users who want continuity across platforms. Notifications alert users to new messages, calls, and status updates, keeping them connected at all times. Additional features like Status, Broadcast lists, and stickers enhance interaction, self-expression, and fun. The interface is simple and intuitive, designed to minimize distractions and streamline communication. By combining speed, security, and convenience, WhatsApp enables personal and professional connections to thrive globally, ensuring users are always engaged, informed, and connected.",
    "size": 50,
    "reviews": "22M",
    "ratingAvg": 4.6,
    "downloads": "5.0B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 16650000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/YBFzctQD/youtudfbe.webp",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s leading video sharing platform, offering users a vast universe of content ranging from educational tutorials, entertainment, vlogs, music videos, documentaries, and live streams. Users can upload, watch, comment, like, and share videos, creating a dynamic community of creators and viewers. YouTube’s advanced algorithms suggest personalized content based on viewing history, preferences, and interests, ensuring engaging and relevant experiences. Creators have access to analytics, monetization tools, and content management features to optimize reach and engagement. Notifications keep users informed about new uploads, live sessions, and important updates. The platform encourages creativity, learning, and collaboration, supporting interactive features like premieres, community posts, polls, and subtitles for inclusivity. YouTube provides a seamless cross-device experience on mobile, desktop, and smart TVs. Its interface is designed for ease of navigation, ensuring that users can explore, discover, and enjoy content without distractions. Beyond entertainment, YouTube fosters knowledge sharing, cultural exchange, and creative expression, offering opportunities for individuals and organizations to educate, inspire, and connect globally in a continuously evolving digital ecosystem.",
    "size": 90,
    "reviews": "30M",
    "ratingAvg": 4.8,
    "downloads": "5.5B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 5500000 },
      { "name": "5 star", "count": 22600000 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/GfL6HxcX/play.webp",
    "title": "Google Play",
    "companyName": "Google LLC",
    "description": "Google Play is a comprehensive digital distribution platform that provides access to millions of apps, games, movies, books, and music for Android devices. Users can discover and download content easily, guided by curated collections, personalized recommendations, and trending charts. Google Play ensures secure transactions, automatic updates, and seamless installation processes, delivering a safe and convenient user experience. App developers can publish, monetize, and promote their products efficiently through analytics, ratings, reviews, and advertising solutions. Notifications alert users to updates, promotions, and new releases, helping them stay current. The platform integrates with Google’s ecosystem, providing synchronization across devices and access to cloud storage, ensuring content is available anytime, anywhere. Its intuitive interface simplifies search, discovery, and management of digital products. By combining convenience, security, and variety, Google Play empowers users to enhance productivity, entertainment, education, and personal growth, while fostering an ecosystem that supports innovation, creativity, and global connectivity for both developers and consumers.",
    "size": 75,
    "reviews": "15M",
    "ratingAvg": 4.5,
    "downloads": "3.0B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 11500000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co.com/Y4mQJsHQ/link.webp",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "description": "Twitter is a fast-paced social networking and news platform where users can share thoughts, updates, and multimedia content instantly. It enables microblogging with tweets of concise messages, images, videos, GIFs, and polls. Advanced algorithms personalize user feeds to prioritize relevant content while ensuring users stay informed on trending topics, breaking news, and global events. Notifications alert users about mentions, retweets, likes, and messages, enhancing engagement. Users can follow individuals, brands, journalists, and communities to build networks and participate in real-time conversations. Twitter offers spaces for audio discussions, trending hashtags, lists, and professional tools for business and marketing. The interface is intuitive, allowing users to navigate quickly and interact seamlessly. Beyond social interaction, Twitter fosters information dissemination, public dialogue, awareness campaigns, and cultural exchange. It empowers individuals, influencers, organizations, and governments to communicate effectively, spark conversations, drive social change, and participate actively in a global digital community.",
    "size": 65,
    "reviews": "10M",
    "ratingAvg": 4.2,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 5400000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/G4vGGSrx/tewL.jpg",
    "title": "Twitter",
    "companyName": "Twitter, Inc.",
    "description": "Signal is a privacy-focused messaging application that provides highly secure communication through end-to-end encryption for messages, calls, and media. Users can send text, images, videos, and documents safely, ensuring that only intended recipients can access the content. Signal prioritizes user privacy, offering features like disappearing messages, screen security, and minimal data retention. Notifications keep users informed while respecting confidentiality. The platform supports voice and video calls, group chats, and stickers for richer engagement. Signal’s interface is clean, minimalistic, and designed to reduce distractions while promoting secure and efficient communication. It is widely trusted by journalists, activists, and privacy-conscious users worldwide. Beyond basic messaging, Signal enables collaborative discussions, secure professional communication, and sensitive data exchange in personal, corporate, and humanitarian contexts. The platform continuously updates security protocols and privacy features, empowering users to communicate freely and confidently without compromising personal information, while fostering trust, safety, and transparency.",
    "size": 60,
    "reviews": "18M",
    "ratingAvg": 4.3,
    "downloads": "1.0B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 14000000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/sXbKKKX/sig.webp",
    "title": "Signal",
    "companyName": "Signal Foundation",
    "description":"Signal is a privacy-focused messaging application that provides highly secure communication through end-to-end encryption for messages, calls, and media. Users can send text, images, videos, and documents safely, ensuring that only intended recipients can access the content. Signal prioritizes user privacy, offering features like disappearing messages, screen security, and minimal data retention. Notifications keep users informed while respecting confidentiality. The platform supports voice and video calls, group chats, and stickers for richer engagement. Signal’s interface is clean, minimalistic, and designed to reduce distractions while promoting secure and efficient communication. It is widely trusted by journalists, activists, and privacy-conscious users worldwide. Beyond basic messaging, Signal enables collaborative discussions, secure professional communication, and sensitive data exchange in personal, corporate, and humanitarian contexts. The platform continuously updates security protocols and privacy features, empowering users to communicate freely and confidently without compromising personal information, while fostering trust, safety, and transparency.",
    "size": 45,
    "reviews": "5M",
    "ratingAvg": 4.7,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 4200000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/cKRG27vy/redd.webp",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "description": "Reddit is a comprehensive discussion and community platform where users can join interest-based communities, known as subreddits, to share content, discuss topics, and engage in meaningful conversations. Users can post text, images, videos, links, and polls, participate in Q&A sessions, and provide feedback through upvotes and downvotes. Reddit supports anonymity while fostering healthy dialogue and community moderation. Notifications alert users about replies, trending posts, and important updates in their communities. The platform’s interface allows easy navigation of topics, personalized feeds, and subreddit subscriptions. Reddit also supports AMAs (Ask Me Anything), live threads, collaborative events, and community challenges, promoting interaction, knowledge sharing, and entertainment. Beyond casual engagement, Reddit enables learning, professional networking, market research, trend discovery, and advocacy. It provides a democratic and user-driven environment where communities can thrive, ideas can be explored, and individuals can express themselves freely while connecting with like-minded people worldwide.",
    "size": 55,
    "reviews": "12M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 2790000 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co.com/pr3LzVYz/Slack.webp",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "description": "Slack is an advanced team communication and collaboration platform designed to enhance productivity in modern workplaces. It supports real-time messaging, file sharing, audio and video calls, and integrates with thousands of third-party apps like Google Drive, Zoom, and Trello. Users can organize conversations into channels based on projects, teams, or topics, ensuring focused discussions. Notifications keep teams informed about updates, mentions, and deadlines, while customizable reminders and integrations improve workflow management. Slack provides searchable message history, collaborative document editing, and workflow automation tools to streamline daily tasks. Its intuitive and minimal interface reduces cognitive load while enhancing team collaboration, fostering creativity, and improving efficiency. By combining communication, organization, and analytics, Slack empowers teams to work smarter, coordinate effectively, and maintain alignment across projects and departments. The platform also emphasizes security, privacy, and data management, making it a reliable choice for businesses of all sizes, enabling remote teams to stay connected, productive, and engaged in a seamless digital workspace.",
    "size": 70,
    "reviews": "8M",
    "ratingAvg": 4.5,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 4050000 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co.com/gZpjSx9t/dr.webp",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "description": "Dropbox is a cloud-based file hosting and collaboration platform that allows users to store, sync, and share documents, photos, videos, and other digital assets securely. It supports seamless cross-device access, enabling users to retrieve and edit files from anywhere in real-time. Dropbox integrates with productivity tools like Microsoft Office, Google Workspace, and Slack, making team collaboration efficient and streamlined. Notifications alert users about file updates, shared folders, and collaboration activity. The platform provides version history, automatic backup, and advanced search functionality to ensure users never lose critical data. Dropbox also offers secure sharing links, permission management, and encryption, prioritizing privacy and data protection. Its interface is minimal and intuitive, reducing friction in file management. Beyond storage, Dropbox fosters teamwork, creativity, and organizational efficiency, making it a central hub for document collaboration, project management, and cloud-based workflows, empowering users and businesses to operate productively in a connected digital environment.",
    "size": 75,
    "reviews": "6M",
    "ratingAvg": 4.3,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co.com/F4vjqCmC/zoom.webp",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "description": "Zoom is a versatile video conferencing and communication platform that facilitates virtual meetings, webinars, online classes, and collaborative sessions with high-quality audio and video. Users can host or join meetings with ease, share screens, record sessions, and use chat for interactive communication. Notifications keep participants informed about upcoming meetings, invitations, and session updates. Zoom supports breakout rooms, polls, live reactions, and collaborative whiteboards, enabling dynamic interaction and engagement. The platform ensures security through encryption, waiting rooms, and access control, maintaining privacy for both personal and professional users. Zoom’s interface is clean and intuitive, providing a seamless experience across desktops, laptops, and mobile devices. Beyond video calls, Zoom supports webinars, team collaboration, event hosting, and large-scale virtual conferences, creating an ecosystem for communication, education, and business continuity. Its reliability, scalability, and user-friendly design make it essential for remote work, online learning, and global connectivity, fostering productivity, learning, and engagement worldwide.",
    "size": 80,
    "reviews": "14M",
    "ratingAvg": 4.2,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 2590000 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co.com/V005H7fs/sSkype.webp",
    "title": "Skype",
    "companyName": "Skype",
    "description": "Skype is a pioneering communication platform that enables instant messaging, voice calls, and video conferencing across the globe. Users can connect one-on-one or in groups, share files, screen share, and communicate via text or voice with high-quality clarity. Notifications ensure users are aware of incoming messages, calls, and updates. Skype provides integration with Microsoft services and other productivity tools, allowing seamless collaboration for work, education, and personal use. Security features include encryption, account verification, and privacy settings, safeguarding communication and sensitive data. Its interface is intuitive, organized, and designed for quick navigation and accessibility. Beyond individual communication, Skype supports webinars, online classes, interviews, and international calls, making it a versatile tool for professional and personal interactions. By combining reliability, accessibility, and robust functionality, Skype empowers global connectivity, fostering meaningful conversations, collaboration, and cultural exchange across borders.",
    "size": 65,
    "reviews": "10M",
    "ratingAvg": 4.1,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 4960000 }
    ]
  },
  {
    "id": 21,
    "image": "https://i.ibb.co.com/84444dLB/Netflix-Netflix.webp",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is a global streaming platform that delivers an extensive library of movies, TV shows, documentaries, and original productions across every genre imaginable. With its adaptive streaming technology, Netflix automatically adjusts video quality for smooth playback, even on slower networks. Personalized recommendations, powered by advanced algorithms, help users discover new titles based on viewing history and preferences. Notifications inform subscribers of new releases, upcoming shows, and personalized reminders. Netflix allows users to create multiple profiles, manage watchlists, and download content for offline viewing, making it versatile for families and individuals alike. The minimalist interface emphasizes ease of navigation and distraction-free exploration, ensuring an immersive entertainment experience. Beyond traditional streaming, Netflix invests in original films, series, and animations, promoting global talent and cultural storytelling. Subtitles, dubbing options, and accessibility features make content available to a worldwide audience. The platform’s combination of convenience, innovation, and storytelling excellence redefines entertainment, transforming how people experience cinema, relaxation, and creativity in the digital era.",
    "size": 95,
    "reviews": "20M",
    "ratingAvg": 4.6,
    "downloads": "1.3B",
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 17800000 }
    ]
  },
  {
    "id": 22,
    "image": "https://i.ibb.co.com/3Y045gn6/Pinterest.webp",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "description": "Pinterest is a visually immersive discovery and inspiration platform that helps users find ideas for every aspect of life — from fashion and home décor to recipes, travel, design, and lifestyle planning. Users can browse millions of 'Pins' — image-based bookmarks — and organize them into themed boards, making it easy to save, categorize, and revisit inspiration. Pinterest’s algorithm curates personalized recommendations based on user interests and browsing behavior, ensuring that every feed feels uniquely tailored. Beyond aesthetics, Pinterest functions as a powerful visual search engine; users can upload or capture images to find visually similar items, products, or ideas. Notifications inform users about trending topics, saved Pins, and collaborative board activity. The interface is beautifully minimal, emphasizing large visuals with minimal text for clarity and focus. Businesses and creators can showcase portfolios, run targeted ads, and analyze engagement insights. Pinterest promotes creativity, discovery, and planning — transforming ideas into action by helping users visualize goals and projects. Whether you’re redecorating your home, learning new recipes, or planning future adventures, Pinterest provides endless inspiration in a calm, organized, and visually delightful environment.",
    "size": 60,
    "reviews": "8M",
    "ratingAvg": 4.5,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 2900000 }
    ]
  },
  {
    "id": 23,
    "image": "https://i.ibb.co.com/hxSTnHqP/thinder.webp",
    "title": "Tinder",
    "companyName": "Tinder, Inc.",
    "description": "Tinder is the world’s most popular dating and social discovery app that helps people meet, match, and connect. It uses a simple swipe-based interface — swipe right to like someone or left to pass — making the experience fun, fast, and intuitive. Beyond casual dating, Tinder fosters new friendships, networking opportunities, and even long-term relationships. With smart location-based matching and personalized recommendations, users can explore potential matches nearby or globally. The app supports customizable bios, interests, and photos to express personality authentically. Its algorithm adapts over time, improving suggestions as users engage. Safety and privacy tools like profile verification and message filters enhance user confidence. From small-town meetups to cross-country connections, Tinder transforms modern dating into a dynamic, global experience built on curiosity, chemistry, and choice.",
    "size": 50,
    "reviews": "5M",
    "ratingAvg": 4.2,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 3150000 }
    ]
  },
  {
    "id": 24,
    "image": "https://i.ibb.co.com/ZRfdfjwD/youtut.webp",
    "title": "YouTube Music",
    "companyName": "Google LLC",
    "description": "YouTube Music is a modern music streaming platform by Google that lets you listen, explore, and discover songs, albums, and playlists from around the world. It offers a vast catalog of official tracks, live performances, remixes, and exclusive YouTube content. Personalized recommendations learn from your tastes and listening habits to curate unique playlists that evolve with you. With seamless integration between video and audio modes, users can switch between watching and listening without interruptions. Offline downloads, background playback, and ad-free experiences are available with premium access. The interface is clean and responsive, featuring smart search powered by Google’s AI — even if you only remember a few lyrics. YouTube Music redefines how users experience sound, blending visual storytelling, artist discovery, and everyday listening into one engaging, intelligent ecosystem.",
    "size": 85,
    "reviews": "15M",
    "ratingAvg": 4.5,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 2450000 }
    ]
  },
  {
    "id": 25,
    "image": "https://i.ibb.co.com/rBN5yB8/Apple-TV.webp",
    "title": "Apple TV",
    "companyName": "Apple Inc.",
    "description": "Apple TV is Apple’s premium streaming service offering original series, movies, and documentaries from top creators around the world. With award-winning productions and cinematic storytelling, it combines the best of entertainment, drama, and innovation. The platform provides a seamless viewing experience across Apple devices, maintaining exceptional video quality with 4K HDR and Dolby Vision support. Users can browse curated categories, personalized recommendations, and exclusive Apple Originals unavailable anywhere else. Notifications inform viewers about new releases and episodes of their favorite shows. The interface is elegant, simple, and free of ads, focusing purely on the content experience. By merging artistry, technology, and accessibility, Apple TV represents Apple’s vision of premium entertainment — immersive, emotional, and beautifully crafted.",
    "size": 90,
    "reviews": "7M",
    "ratingAvg": 4.4,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 6100000 }
    ]
  },
  {
    "id": 26,
    "image": "https://i.ibb.co.com/NnVyVkHn/Google-Drivegfrf.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "description":"Google Drive is a secure and versatile cloud storage platform that allows users to store, share, and collaborate on files from anywhere. It supports documents, photos, videos, and large projects, all accessible across devices. Users can organize files in folders, set permissions, and collaborate in real-time with others. Integrated with Google Workspace, Drive connects seamlessly to Docs, Sheets, and Slides, simplifying teamwork. The platform includes intelligent search powered by Google AI to locate files instantly, even using keywords within documents. Notifications keep users updated on edits, comments, and sharing activity. Offline access ensures productivity without an internet connection. With strong encryption, privacy controls, and powerful collaboration tools, Google Drive has become an essential space for modern work, learning, and digital storage.",
    "size": 80,
    "reviews": "12M",
    "ratingAvg": 4.3,
    "downloads": "1.0B",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 8900000 }
    ]
  },
  {
    "id": 27,
    "image": "https://i.ibb.co.com/Y4yY4X9x/Adobe-Creative-Cloud.webp",
    "title": "Adobe Creative Cloud",
    "companyName": "Adobe Inc.",
    "description":"Adobe Creative Cloud is a suite of industry-leading design and productivity tools for artists, photographers, and creative professionals. It includes applications like Photoshop, Illustrator, Premiere Pro, After Effects, and Lightroom, empowering users to create across digital and print media. With cloud integration, projects sync automatically across devices, making remote collaboration easy. Notifications update users about app versions, shared files, and creative trends. Adobe’s AI engine, Sensei, enhances workflows by automating tasks like photo correction, masking, and motion graphics. The platform also offers stock images, fonts, and templates to boost creativity. Its intuitive dashboard allows users to manage subscriptions, assets, and project libraries. From concept to final delivery, Creative Cloud fuels imagination and productivity in a seamless ecosystem built for innovation and artistry.",
    "size": 120,
    "reviews": "4M",
    "ratingAvg": 4.2,
    "downloads": "150M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 28,
    "image": "https://i.ibb.co.com/vvDZPxd5/Apple-Music.webp",
    "title": "Apple Music",
    "companyName": "Apple Inc.",
    "description": "Reels is Instagram’s short-form video platform designed for creativity, self-expression, and entertainment. Users can record, edit, and share 15–90 second videos with audio, effects, and AR filters to showcase their ideas. The Reels feed promotes viral discovery through an algorithm that highlights trending content and creators. Music integration allows synchronization with beats for dynamic storytelling. Notifications keep users informed about views, likes, and shares. Reels also helps brands and influencers reach new audiences through organic visibility and creative campaigns. The interface is fluid and intuitive, encouraging quick scrolling and endless exploration. It’s not just a video tool — it’s a global stage for talent, humor, and inspiration where everyone has a chance to go viral.",
    "size": 65,
    "reviews": "10M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 4150000 }
    ]
  },
  {
    "id": 29,
    "image": "https://i.ibb.co.com/kV7T8XKh/unnamed.webp",
    "title": "Adobe Creative Cloud",
    "companyName": "Adobe Inc.",
    "description":  "Adobe Creative Cloud is an all-in-one creative ecosystem built for designers, filmmakers, photographers, illustrators, and storytellers who want their imagination to take center stage. It’s not just a collection of tools — it’s a creative universe that brings together more than twenty professional-grade applications such as Photoshop, Illustrator, Premiere Pro, After Effects, Lightroom, and Adobe XD, each seamlessly integrated through the cloud. Users can design stunning visuals, edit photos with pixel-perfect precision, craft cinematic videos, animate characters, or build responsive web experiences — all from a single connected workspace. Through Adobe Sensei, its powerful AI engine, mundane tasks like background removal, color correction, and smart object tracking become effortless, allowing artists to focus purely on creativity. Every project automatically syncs to the cloud, so you can begin on a desktop, continue on a tablet, and finish on your phone without missing a beat. Creative Cloud Libraries make asset management intuitive — fonts, brushes, graphics, and colors remain consistent across every device and team member. Collaboration sits at the heart of Creative Cloud. Shared project links, live comments, and co-editing features make teamwork fluid and productive. Notifications keep users updated on version changes, new asset uploads, and design feedback in real time. Integration with Adobe Stock and Behance opens the door to millions of royalty-free assets and a vibrant global creative community. With enterprise-grade security, frequent updates, and access to exclusive learning resources, Adobe Creative Cloud constantly evolves to meet the demands of modern creators. Whether you’re editing a blockbuster film, illustrating a children’s book, or crafting a marketing campaign, Adobe Creative Cloud provides the power, precision, and freedom to transform ideas into masterpieces — wherever inspiration strikes.",
    "size": 110,
    "reviews": "4M",
    "ratingAvg": 4.2,
    "downloads": "150M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 30,
    "image": "https://i.ibb.co.com/1YszS594/whats.webp",
    "title": "WhatsApp Business",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp Business is a communication app designed to help small and medium-sized businesses connect with customers more efficiently. It offers features like automated greetings, quick replies, and message labels to organize conversations. Businesses can showcase catalogs, product details, and service information directly in chat. Notifications update owners on customer messages and orders in real time. With end-to-end encryption, conversations remain private and secure. The interface mirrors regular WhatsApp, ensuring familiarity for both users and clients. Integrations with Meta’s business tools enable marketing campaigns and analytics. WhatsApp Business helps build trust, maintain relationships, and provide professional support — all within the comfort of a simple, fast, and globally recognized messaging platform.",
    "size": 45,
    "reviews": "4M",
    "ratingAvg": 4.5,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 2670000 }
    ]
  }

  
]


